Repository: DlangRen/Programming-in-D-OmegaT
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: $(C !is) is the opposite of $(C is).
zh_cn: $(C !is) 与 $(C is) 相反。

source: $(C .get()) is useful in such cases: it returns the value associated with the specified key if that key exists, otherwise it returns the default value.
zh_cn: $(C .get()) 在这样的样例中是有用的：如果指定键存在则返回相应值，否则返回默认值。

source: $(C .idup) is used for producing immutable strings from existing strings: )
zh_cn: $(C .idup) 可用来从存在字符串产生不可变的字符串： )

source: $(C readf()) continues to wait for more characters to add to the string: )
zh_cn: $(C readf()) 继续等待新输入的字符添加到字符串： )

source: $(C variable1) and $(C variable2) above merely provide access to that anonymous object: )
zh_cn: 上面的 $(C variable1) 和 $(C variable2) 只提供对那个匿名对象的访问： )

source: $(COZUM_BOLUMU Associative Arrays)
zh_cn: $(COZUM_BOLUMU 关联数组)

source: $(COZUM_BOLUMU Strings)
zh_cn: $(COZUM_BOLUMU 字符串)

source: $(DERS_BOLUMU $(IX associative array) $(IX AA) Associative Arrays)
zh_cn: $(DERS_BOLUMU $(IX 关联数组) $(IX AA) 关联数组)

source: $(DERS_BOLUMU $(IX class) Classes)
zh_cn: $(DERS_BOLUMU $(IX class) 类)

source: $(H5 $(IX &quot;) Double quotes, not single quotes)
zh_cn: $(H5 $(IX &quot;) 双引号，非单引号)

source: $(H5 $(IX formattedRead) $(C formattedRead) for parsing strings)
zh_cn: $(H5 $(IX formattedRead) $(C formattedRead) 函数可以解析字符串)

source: $(H5 $(IX in, associative array) Determining the presence of a key)
zh_cn: $(H5 $(IX in, 关联数组) 确定键的存在)

source: $(H5 $(IX readln) $(IX strip) $(C readln) and $(C strip), instead of $(C readf))
zh_cn: $(H5 $(IX readln) $(IX strip) $(C readln) 和 $(C strip)，代替 $(C readf))

source: $(H5 $(IX remove) Removing key-value pairs)
zh_cn: $(H5 $(IX remove) 移除键值对)

source: $(H5 $(IX string) $(IX wstring) $(IX dstring) $(IX char[]) $(IX wchar[]) $(IX dchar[]) $(IX immutable) $(C string), $(C wstring), and $(C dstring) are immutable)
zh_cn: $(H5 $(IX string) $(IX wstring) $(IX dstring) $(IX char[]) $(IX wchar[]) $(IX dchar[]) $(IX immutable) $(C string)，$(C wstring)，和 $(C dstring) 是不可变的)

source: $(H5 Adding key-value pairs)
zh_cn: $(H5 添加键值对)

source: $(H5 Definition)
zh_cn: $(H5 定义)

source: $(H5 Example)
zh_cn: $(H5 样例)

source: $(H5 Initialization)
zh_cn: $(H5 初始化)

source: $(H5 Properties)
zh_cn: $(H5 Properties（属性）)

source: $(H5 Summary)
zh_cn: $(H5 摘要)

source: $(H6 $(IX assignment, class) Assignment)
zh_cn: $(H6 $(IX assignment, class) 赋值)

source: $(H6 $(IX copy, class) Copying)
zh_cn: $(H6 $(IX copy, class) 复制)

source: $(H6 $(IX is, operator) $(IX !is) The $(C is) and $(C !is) operators)
zh_cn: $(H6 $(IX is, 运算符) $(IX !is) $(C is) 和 $(C !is) 运算符)

source: $(H6 Construction)
zh_cn: $(H6 构造函数)

source: $(H6 Definition)
zh_cn: $(H6 定义)

source: $(H6 Destruction)
zh_cn: $(H6 析构函数)

source: $(H6 Member functions)
zh_cn: $(H6 成员函数)

source: $(H6 Operator overloading)
zh_cn: $(H6 运算符重载)

source: $(HILITE final) int func() { $(CODE_NOTE Recommended)
zh_cn: $(HILITE final) int func() { $(CODE_NOTE 推荐)

source: $(I ($(B Note:) This is related to name scopes, as well as object lifetimes, which will be explained in $(LINK2 /ders/d.en/lifetimes.html, a later chapter.))) )
zh_cn: $(I ($(B 注：) 这与命名作用域，以及对象生存期有关，这将在 $(LINK2 /ders/d.cn/lifetimes.html, 后面的章节) 中解释。)) )

source: $(I value_type)[$(I key_type)] $(I associative_array_name); ---
zh_cn: $(I 值类型)[$(I 键类型)] $(I 关联数组名); ---

source: $(LI Although some of the functions in Phobos modules will be easy to use with strings, library documentations are usually terse compared to tutorials.
zh_cn: $(LI 对于字符串，虽然 Phobos 模块的一些函数易于使用，但库文档通常比教程简洁。

source: $(LI Another solution is to assign an empty array:
zh_cn: $(LI 另一种解法是用空数组赋值：

source: $(LI Many other functions may be chained as well:
zh_cn: $(LI 许多别的函数可以嵌套使用Many other functions may be chained as well:

source: $(LI Since the initial value of an array is an empty array anyway, the following technique would achieve the same result:
zh_cn: $(LI 由于数组的初始值无论如何都是一个空数组，那么下面的技术将得到一样的结果：

source: $(LI The $(C .keys) property returns a slice (i.e. dynamic array) that includes all of the keys of the associative array.
zh_cn: $(LI $(C .keys) property（属性）返回一个切片(即 动态数组)，它包含了关联数组全部的键。

source: $(LI The goal is to store multiple grades per student.
zh_cn: $(LI 目标是存储每个学生的多个成绩。

source: $(LI 类是引用类型。The $(C new) 关键字构造一个匿名 $(I class 对象) 并返回一个 $(I class 变量)。 )
zh_cn: $(LI 类是引用类型。 $(C new) 关键字构造一个匿名 $(I class 对象) 并返回一个 $(I class 变量)。 )

source: $(LI $(C catch) and $(C finally) cannot be used without a $(C try) block.)
zh_cn: $(LI 没有一个 $(C try) 块， $(C catch) 和 $(C finally) 不能使用。)

source: $(LI $(C scope(failure)): the expression is executed only if the scope is being exited due to an exception) )
zh_cn: $(LI $(C scope(failure))：表达式只在因出现异常而退出作用域时被执行。) )

source: $(LI $(C scope(success)): the expression is executed only if the scope is being exited successfully)
zh_cn: $(LI $(C scope(success))：表达式只在成功退出作用域时被执行。)

source: $(LI $(IX .byKey) $(C .byKey) provides access to the keys without copying them; we will see how $(C .byKey) is used in $(C foreach) loops in the next chapter.)
zh_cn: $(LI $(IX .byKey) $(C .byKey) 提供对键的直接访问；在下一章我们将看到在 $(C foreach) 循环中如何使用 $(C .byKey) 。)

source: $(LI $(IX .byKeyValue) $(C .byKeyValue) provides access to the key-value pairs without copying them.)
zh_cn: $(LI $(IX .byKeyValue) $(C .byKeyValue) 提供对键值对的直接访问。)

source: $(LI $(IX .byValue) $(C .byValue) provides access to the values without copying them.)
zh_cn: $(LI $(IX .byValue) $(C .byValue) 提供对值的直接访问。)

source: $(LI $(IX .clear) $(C .clear) removes all elements.)
zh_cn: $(LI $(IX .clear) $(C .clear) 移除全部元素。)

source: $(LI $(IX .get) $(C .get) returns the value if it exists, the default value otherwise.)
zh_cn: $(LI $(IX .get) $(C .get) 值存在即返回相应值，否则返回默认值。)

source: $(LI $(IX .keys) $(C .keys) returns a copy of all keys as a dynamic array.)
zh_cn: $(LI $(IX .keys) $(C .keys) 返回全部键的动态数组副本。)

source: $(LI $(IX .length) $(C .length) returns the number of key-value pairs.)
zh_cn: $(LI $(IX .length) $(C .length) 返回键值对的个数。)

source: $(LI $(IX .rehash) $(C .rehash) may make the array more efficient in some cases, such as after inserting a large number of key-value pairs.)
zh_cn: $(LI $(IX .rehash) $(C .rehash) 在一些例子中可以让数组更有效率，比如在插入大量的键值对之后。)

source: $(LI $(IX .remove) $(C .remove) removes the specified key and its value from the array.)
zh_cn: $(LI $(IX .remove) $(C .remove) 从数组中移除指定的键和值。)

source: $(LI $(IX .sizeof, associative array) $(C .sizeof) is the size of the array $(I reference) (it has nothing to do with the number of key-value pairs in the table and is the same value for all associative arrays).)
zh_cn: $(LI $(IX .sizeof, associative array) $(C .sizeof) 数组$(I 引用)大小（它不受表中键值对个数的影响，对所有的关联数组来说值都是一样的）。)

source: $(LI $(IX .values) $(C .values) returns a copy of all values as a dynamic array.)
zh_cn: $(LI $(IX .values) $(C .values) 返回全部值的动态数组副本。)

source: $(LI Assigning an empty associative array.)
zh_cn: $(LI 用一个空的关联数组赋值。)

source: $(LI Assignment associates a variable with an object.
zh_cn: $(LI 赋值会把一个变量与一个对象相关联。

source: $(LI Class variables that are not associated with any object are $(C null).
zh_cn: $(LI 不与任何对象相关联的类变量为 $(C null)。

source: $(LI Classes and structs share common features but have big differences.
zh_cn: $(LI 类和结构虽然有共同特点，但还是有很大的差异。

source: $(LI Classes are reference types.
zh_cn: $(LI 类是引用类型。

source: $(LI Removing them one-by-one from the associative array.)
zh_cn: $(LI 从关联数组中逐个移除它们。)

source: $(LI Similar to the previous method, assigning the array's $(C .init) property.
zh_cn: $(LI 与前一方法相似，用数组的 $(C .init) 属性赋值。

source: $(LI Some of the variables that these blocks need may not be accessible within these blocks:
zh_cn: $(LI 属于块的某些变量，块范围内有可能访问不到：

source: $(LI The act of copying associates an additional variable with an object.
zh_cn: $(LI 复制操作将增加一个与对象关联的变量。

source: $(LI This program uses two indexes to make a slice:
zh_cn: $(LI 这段程序使用两个索引值来生成一个切片：

source: $(LI Writing all of potentially unrelated expressions in the single $(C finally) block at the bottom separates those expressions from the actual code that they are related to.
zh_cn: $(LI 把所有可能无关联的表达式写在底部单独的 $(C finally) 块，就可以分离那些有关联的可执行代码。

source: $(LI 一个类的析构函数不得访问由垃圾回收器管理的成员。这是因为垃圾回收器没有必要保证该对象及其成员按任何特定顺序终结。当析构函数执行时，全部成员应该已经终结。)
zh_cn: $(LI 一个类的析构函数不得访问由垃圾回收器管理的成员。这是因为垃圾回收器没有被要求保证该对象及其成员按任何特定顺序终结。当析构函数执行时，全部成员应该已经终结。)

source: $(LI 类的析构函数不必分配新的内存给垃圾回收器。这是因为垃圾回收器没有必要保证在垃圾回收周期内能分配新的对象。)
zh_cn: $(LI 类的析构函数一定不分配由垃圾回收器管理的新内存。这是因为垃圾回收器没有被要求保证在垃圾回收周期内能分配新的对象。)

source: $(OL $(LI The type of string literals like $(STRING "hello") is $(C string), not $(C char[]), so they are immutable.
zh_cn: $(OL $(LI 像 $(STRING "hello") 这样的字符串字面量的类型是 $(C string)，而不是 $(C char[])，因此它们不可变。

source: $(P $(C .clear) removes all elements: )
zh_cn: $(P $(C .clear) 移除全部元素： )

source: $(P $(C is) specifies whether two class variables provide access to the same class object.
zh_cn: $(P $(C is) 确定两个类变量是否提供对同一对象的访问。

source: $(P $(C readln()) can be used without a parameter.
zh_cn: $(P $(C readln()) 没有参数也可以使用。

source: $(P $(C readln()) is more suitable when reading strings.
zh_cn: $(P $(C readln()) 更适合读取字符串。

source: $(P $(C readln()) stores the new-line character as well.
zh_cn: $(P $(C readln()) 也存储新行符。

source: $(P $(C scope) statements can be specified as blocks as well: )
zh_cn: $(P $(C scope) 语句也可以像块一样使用： )

source: $(P $(I $(B Note:) An associative array that is defined without any element is $(LINK2 /ders/d.en/null_is.html, $(C null)), not empty.
zh_cn: $(P $(I $(B 注：) 已定义的没有任何元素的关联数组是 $(LINK2 /ders/d.cn/null_is.html, $(C null))，而不是空。

source: $(P $(I $(B Note:) It is usually not proper to access members directly as in the code above.
zh_cn: $(P $(I $(B 注：) 在上面的代码中，一般不这样直接访问成员。

source: $(P $(I $(B 注：) 在上面的代码中，一般不这样直接访问成员。若确实需要这样的语法，应该首选属性，这将在 $(LINK2 /ders/d.cn/property.html, 后面的章节) 中解释。) )
zh_cn: $(P $(I $(B 注：) 在上面的代码中，一般不这样直接访问成员。若确实需要这样的语法，应该首选属性，这将在 $(LINK2 /ders/d.cn/property.html, 后面的一章) 中解释。) )

source: $(P $(IX .init, clearing a variable) $(I $(B Note:) The $(C .init) property of any variable or type is the initial value of that type:) )
zh_cn: $(P $(IX .init, 清除一个变量) $(I $(B 注：) 任何变量或类型的 $(C .init) 属性是类型的初始值：) )

source: $(P $(IX :, associative array) Sometimes some of the mappings between the keys and the values are already known at the time of the definition of the associative array.
zh_cn: $(P $(IX :, 关联数组) 有时候一些键与值的映射在定义关联数组的时候就已经明确。

source: $(P $(IX OOP) $(IX 面向对象编程) 与结构相似， $(C class) 具有定义新类型的功能。不同于结构的是，在D中，类提供 $(I 面向对象编程) (OOP) 模型。下面是OOP的主要方面： )
zh_cn: $(P $(IX OOP) $(IX 面向对象编程) 与结构相似， $(C class) 具有定义新类型的功能。不同于结构的是，在D语言中，类提供 $(I 面向对象编程) (OOP) 模型。下面是OOP的主要方面： )

source: $(P $(IX final) As overridable member functions have a runtime performance cost, without going into more detail, I recommend that you define all $(C class) functions that do not need to be overridden with the $(C final) keyword.
zh_cn: $(P $(IX final) 由于可重写的成员函数有一个运行时性能消耗，在这儿不讨论更多细节，我推荐您定义全部没必要用 $(C final) 关键字重写的 $(C class) 成员函数。

source: $(P $(IX 终结与析构) 然而，不同于结构，在一个类对象的生命期结束时，类的析构函数并不执行。正如上面我们看到的，析构函数在一个垃圾回收周期内的未来某个时候执行。(通过这样的区分，更准确的说，类析构函数应该叫 $(I 终结函数)) 。 )
zh_cn: $(P $(IX 终结与析构) 然而，不同于结构，在一个类对象的生命期结束时，类的析构函数并不执行。正如上面我们看到的，析构函数在一个垃圾回收周期内的未来某个时候执行。(通过这样的区分，更准确的说，类的析构函数应该叫 $(I 终结函数)) 。

source: $(P Although member functions are defined and used the same way as structs, there is an important difference: Class member functions can be and by-default are $(I overridable).
zh_cn: $(P 虽然成员函数的定义与用法与结构相同，有个重要的不同：类成员函数默认是 $(I 可重写的) 。

source: $(P Although the syntax makes it look as if a member of the $(I variable) is being accessed, it is actually the member of the $(I object).
zh_cn: $(P 虽然语法上看起来像访问 $(I 变量) 的成员，实际上是 $(I 对象) 的成员。

source: $(P Although these statements are closely related to exceptions, they can be used without a $(C try-catch) block.
zh_cn: $(P 虽然这些语句只在特殊情况下使用，但是没有 $(C try-catch) 块也能用。

source: $(P Another difference from structs is that some member functions are automatically inherited from the $(C Object) class.
zh_cn: $(P 与结构不同的是一些成员函数自动继承自 $(C Object) 类。

source: $(P As a result, the objects that are associated with $(C var1) and $(C var2) are different.
zh_cn: $(P 结果是，$(C var1) 和 $(C var2) 相关联的对象是不同的。

source: $(P As an example, let's write the function above with a $(C scope(failure)) statement: )
zh_cn: $(P 例如，让我们用 $(C scope(failure)) 语句写一下面的函数： )

source: $(P As seen in the outputs, the blocks of the $(C scope) statements are executed in reverse order.
zh_cn: $(P 在输出中我们看到，$(C scope) 语句块是按相反的顺序执行的。

source: $(P As we have seen in the previous chapter, expressions that must always be executed are written in the $(C finally) block, and expressions that must be executed when there are error conditions are written in $(C catch) blocks.
zh_cn: $(P 在前面的章节我们已经看到，写在 $(C finally) 块里的表达式一定总被执行。当有错误条件的时候，写在 $(C catch) 块里的表达式总被执行。

source: $(P As with structs, the name of the constructor is $(C this).
zh_cn: $(P 与结构一样，构造函数的名称是 $(C this) 。

source: $(P As with structs, the name of the destructor is $(C ~this): )
zh_cn: $(P 像结构一样，析构函数的名称是 $(C ~this): )

source: $(P Assigning to a class variable disassociates that variable from its current object and associates it with a new object.
zh_cn: $(P 给类变量赋值，会解除变量与当前对象的关联，并关联到一个新对象。

source: $(P Associative arrays allow indexing not only using integers but also using any other type.
zh_cn: $(P 关联数组允许索引不只是整型而是任何类型。

source: $(P Associative arrays are a feature that is found in most modern high-level languages.
zh_cn: $(P 关联数组是大多数现代高级编程语言所具有的功能。

source: $(P Associative arrays are implemented in D using a $(I hash table).
zh_cn: $(P 在D语言中，关联数组是一个 $(I hash 表) 实现。

source: $(P Associative arrays make it easy to access the grades by the name of the student as in $(C grades["emre"]).
zh_cn: $(P 在 $(C grades["emre"]) 中通过学生姓名关联数组让它很容易访问到成绩。

source: $(P Assume that an associative array is used for storing student grades.
zh_cn: $(P 假设使用关联数组来存储学生成绩。

source: $(P Because classes are reference types, defining a new class variable as a copy of another makes two variables that provide access to the same object.
zh_cn: $(P 因为类是引用类型，定义一个新的类变量做为另一个副本，将产生两个访问同一对象的变量。

source: $(P Being character arrays, strings can contain control characters like $(STRING '\n') as well.
zh_cn: $(P 作为字符数组，字符串能包含像 $(STRING '\n') 这样的控制字符。

source: $(P Both $(C readf()) and $(C formattedRead()) $(I return) the number of items that they could parse and convert successfully.
zh_cn: $(P $(C readf()) 和 $(C formattedRead()) 函数 都可以成功$(I 返回)解析及转换的项目个数。

source: $(P Both of the variables above provide access to the same object.
zh_cn: $(P 上面的两个变量都提供对同一对象的访问。

source: $(P Classes are defined by the $(C class) keyword instead of the $(C struct) keyword: )
zh_cn: $(P 类由 $(C class) 关键字定义而不是 $(C struct) 关键字： )

source: $(P Copying affects only the variables, not the object.
zh_cn: $(P 复制只影响变量，而不是对象。

source: $(P For example, an associative array that maps day names of type $(C string) to day numbers of type $(C int) can be defined like this: )
zh_cn: $(P 例如，下面这个关联数组这样定义，它把日期名的类型 $(C string) 映射到日期的数字类型 $(C int) ： )

source: $(P For example, the following code that tries to capitalize the first letter of a $(C string) would cause a compilation error: )
zh_cn: $(P 例如，下面这段代码尝试着修改$(C 字符串)的首字母为大写，将引发一个编译错误： )

source: $(P For plain arrays, index values are not stored at all.
zh_cn: $(P 对于简单数组，索引值根本就没有存储。

source: $(P For that syntax to work, a constructor must be defined explicitly by the programmer.
zh_cn: $(P 那样的语法要通过编译，就需要程序员显式的定义构造函数。

source: $(P Here is a program that prints the Turkish names of colors that are specified in English: )
zh_cn: $(P 这是一段打印英文颜色的土耳其语表达的程序，它的键指定为英文： )

source: $(P Here is another function that tests all three of these statements: )
zh_cn: $(P 这儿是另一个函数，来测试全部三个语句： )

source: $(P How can you solve this problem?
zh_cn: $(P 怎么解决这个问题？

source: $(P I will start using that form after introducing the $(C string) type below.
zh_cn: $(P 在介绍了下面的 $(C string) 类型之后，我将开始使用格式化。

source: $(P If an exception is thrown, the output includes the $(C scope(exit)) and $(C scope(failure)) expressions: )
zh_cn: $(P 如果抛出异常， 输出包括 $(C scope(exit)) 和 $(C scope(failure)) 表达式： )

source: $(P If no exception is thrown, the output of the function includes only the $(C scope(exit)) and $(C scope(success)) expressions: )
zh_cn: $(P 如果没有抛出异常， 函数的输出只包括 $(C scope(exit)) 和 $(C scope(success)) 表达式： )

source: $(P If there is no other class variable that still provides access to the object that has been disassociated from, then that object is going to be destroyed some time in the future by the garbage collector.
zh_cn: $(P 如何没有别的类变量能访问已解除关联对象，那该对象将由垃圾回收器在将来某个时候销毁。

source: $(P In the code above, $(C variable2) is being initialized by $(C variable1).
zh_cn: $(P 在上面的代码中， $(C variable2) 由 $(C variable1) 初始化。

source: $(P Just like copying, assignment affects only the variables.
zh_cn: $(P 就像复制，赋值只影响变量。

source: $(P Key-value pairs can be removed by using $(C .remove()): )
zh_cn: $(P 通过 $(C .remove()) 可以移除键值对： )

source: $(P Let's consider the following code that we have seen previously in the $(LINK2 /ders/d.en/value_vs_reference.html, Value Types and Reference Types chapter): )
zh_cn: $(P 让我们考虑一下下面我们以前在 $(LINK2 /ders/d.cn/value_vs_reference.html, 值类型和引用类型章节) 看到过的代码： )

source: $(P On the other hand, associative arrays do store both the keys and the values of elements.
zh_cn: $(P 另一方面，关联数组既存储键又存储元素值。

source: $(P Once a line is read from the input or from any other source, it is possible to parse and convert separate data that it may contain with $(C formattedRead()) of the $(C std.format) module.
zh_cn: $(P 一但从输入端或别的任何源处读取了一行，$(C std.format) 模块的 $(C formattedRead()) 函数就有可能去解析并转换分割的数据。

source: $(P One way of terminating the standard input stream in a terminal is pressing Ctrl-D under Unix-based systems and Ctrl-Z under Windows systems.
zh_cn: $(P 在终端结束标准输入流的方法随系统而不同，在 Unix 系统下按 Ctrl-D，在 Windows 系统下按 Ctrl-Z。

source: $(P Other than the fact that $(C opAssign) cannot be overloaded for classes, operator overloading is the same as structs.
zh_cn: $(P 虽然 $(C opAssign) 不能被类重载，但与结构一样，可以实现运算符重载。

source: $(P Same as structs, the members are accessed by the $(I dot) operator: )
zh_cn: $(P 与结构一样，用 $(I 点) 运算符访问成员： )

source: $(P Similarly, $(C char[]) cannot be used where a $(C string) is needed.
zh_cn: $(P 同样的，$(C char[]) 不能被用到需要 $(C string) 的地方。

source: $(P Similarly, an $(C immutable) copy of an object can be provided by a member function appropriately named $(C idup()): )
zh_cn: $(P 同样的，可以由命名为 $(C idup()) 的适当的成员函数提供对象的 $(C immutable) 副本： )

source: $(P Since $(C char[]) is mutable and $(C string) is not, there is a mismatch.
zh_cn: $(P 由于 $(C char[]) 可变而 $(C string) 不可变，两者不批配。

source: $(P Since no object gets copied, the postblit function $(C this(this)) is not available for classes.
zh_cn: $(P 由于没有复制对象， postblit 函数 $(C this(this)) 不能用于类变量。

source: $(P Since the array does not contain a value for the key $(STRING "purple"), $(C .get()) returns -1: )
zh_cn: $(P 由于键 $(STRING "purple") 的值不在数组中，$(C .get()) 返回 -1： )

source: $(P Since the objects of $(C myKing) and $(C yourKing) variables are different, the $(C !is) operator returns $(C true).
zh_cn: $(P 由于 $(C myKing) 和 $(C yourKing) 变量来自不同的对象，$(C !is) 运算符返回 $(C true)。

source: $(P Sometimes it makes sense to use a default value if a key does not exist in the associative array.
zh_cn: $(P 有时候在关联数组中，为不存在的键使用一个默认值是有道理的。

source: $(P Such control characters as well as all whitespace characters at both ends of strings can be removed by $(C std.string.strip): )
zh_cn: $(P 字符串两端的像空白符这样的控制字符能被 $(C std.string.strip) 移除： )

source: $(P That function first modifies the reference parameter and then reverts this modification when an exception is thrown.
zh_cn: $(P 上面这个函数首先修改引用参数，当出现异常时再恢复修改。

source: $(P That solution may be slow especially for large arrays.
zh_cn: $(P 对于大型数组这恐怕会非常慢。

source: $(P The $(C dayNumbers) variable above is an associative array that can be used as a table that provides a mapping from day names to day numbers.
zh_cn: $(P 上面的 $(C dayNumbers) 变量是一个关联数组，它能用来作为从日期名映射到日期数字的表。

source: $(P The $(C dup()) member function makes a new object by taking advantage of the constructor of $(C Foo) and returns the new object.
zh_cn: $(P $(C dup()) 成员函数利用 $(C Foo) 的构造函数，创建并返回新的对象。

source: $(P The $(C in) operator determines whether a given key exists in the associative array: )
zh_cn: $(P $(C in) 运算符确定一个给定的键是否存在于关联数组中： )

source: $(P The $(C new) keyword constructs an anonymous class object.
zh_cn: $(P $(C new) 关键字构造了一个匿名的类对象。

source: $(P The $(C scope(failure)) statement above ensures that the $(C r -= addend) expression will be executed if the function's scope is exited due to an exception.
zh_cn: $(P 上面的 $(C scope(failure)) 确保 $(C r -= addend) 表达式在因异常退出时被执行。

source: $(P The $(C scope) statements have similar functionality with the $(C catch) and $(C finally) scopes but they are better in many respects.
zh_cn: $(P $(C scope) 语句与 $(C catch) 和 $(C finally) 有相似功能，但在许多方面表现的更好。

source: $(P The $(C strip()) expression above returns a new string that does not contain the trailing control characters.
zh_cn: $(P 上面的 $(C strip()) 表达式返回一个不包含尾随控制符的新字符串。

source: $(P The Enter key that the user presses after the name does not terminate the input.
zh_cn: $(P 用户在名字之后按的 Enter 键并没有结束输入。

source: $(P The assignment above makes $(C variable1) leave its object and start providing access to $(C variable2)'s object.
zh_cn: $(P 上面的赋值让 $(C variable1) 离开其对象并且开始提供对 $(C variable2) 的对象的访问。

source: $(P The behavior of assignment cannot be changed for classes.
zh_cn: $(P 赋值操作不能改变类。

source: $(P The exclamation mark appears after those characters instead of being printed right after the name.
zh_cn: $(P 感叹号出现在了那些字符之后，而不是打印在名字右侧。

source: $(P The fact that plain arrays provide access to their values through index numbers can be described as an $(I association) of indexes with values.
zh_cn: $(P 事实上简单数组通过索引访问值可以被描述为索引与值的$(I 关联) 。

source: $(P The first line above removes the key-value pair "Tuesday" / $(C 1).
zh_cn: $(P 上面第一行移除了键值对 "Tuesday" / $(C 1).

source: $(P The following code makes use of $(C dup()) to create a new object: )
zh_cn: $(P 下面的代码演示 $(C dup()) 创建一个新的对象的用法： )

source: $(P The grades can also be assigned in one go with an array literal: )
zh_cn: $(P 成绩也可以作为数组文本一次性赋值： )

source: $(P The high performance of hash tables comes at the expense of storing the elements in an unordered way.
zh_cn: $(P hash 表的高性能的代价是元素的存储是无序的。

source: $(P The keys of associative arrays can be of any type, including user-defined $(C struct) and $(C class) types.
zh_cn: $(P 关联数组的键可以是任何类型，包括用户定义的 $(C struct) 和 $(C class) 类型。

source: $(P The length of associative arrays cannot be specified when defined.
zh_cn: $(P 定义时，不能指定关联数组的长度。

source: $(P The name of a specific day can be accessed by its index in that array: )
zh_cn: $(P 在数组里通过索引访问特定的英文日期名： )

source: $(P The output indicates that the values 0 and 1 correspond to keys "Monday" and "Tuesday", respectively: )
zh_cn: $(P 下面的输出表明了元素值 0 和 1 分别对应着键 “Monday” 和 “Tuesday”： )

source: $(P The program can now be compiled and will print the modified string: )
zh_cn: $(P 现在程序能通过编译并且打印修改后的字符串： )

source: $(P The solution here is to take a copy of the immutable string by using the $(C .dup) property: )
zh_cn: $(P 这儿的解决办法是通过 $(C .dup) property（属性）得到一个不可变字符串的副本： )

source: $(P The syntax of associative arrays is similar to the array syntax.
zh_cn: $(P 关联数组的语法与数组相似。

source: $(P The table grows automatically with each association.
zh_cn: $(P 随着每次的关联，该表会自动增长。

source: $(P There are surprises even when reading strings from the terminal.
zh_cn: $(P 从终端读字符串您会有一些惊奇。

source: $(P There are three $(I aliases) of the $(I immutable) versions of those types: $(C string), $(C wstring), and $(C dstring).
zh_cn: $(P 这些类型的 $(I immutable) 版本有三个$(I 别名)：$(C string)，$(C wstring)，和 $(C dstring)。

source: $(P There are three string types that correspond to the three character types: $(C char[]), $(C wchar[]), and $(C dchar[]).
zh_cn: $(P 三种字符串类型对应着三种字符类型：$(C char[])，$(C wchar[])，和 $(C dchar[])。
